content/posts/book-review-masters-of-doom.md
+++
title = "Book Review: Masters of Doom"
author = ["Sreejith Pp"]
date = 2018-10-27T00:00:00+05:30
tags = ["books", "review", "gaming"]
categories = ["books"]
draft = false
+++

## Review {#review}

So, I recently read Masters of Doom by David Kushner and thought I'd post my book review here. I also hope to make this a regular thing.

[Masters of Doom](https://www.goodreads.com/book/show/222146.Masters%5Fof%5FDoom)

As someone who used to play a ton of video games and who got into programming making or hacking them, this was an enjoyable, nostalgic experience. Written in dramatic fashion, yet technically not too demanding, this book takes you through the evolution of pc gaming, the rise of an entire sub-culture, and the molding of art, bleeding-edge tech, and storytelling in the birth of doom. It's the story of 2 immensely talented people, their successes, and the differences that ripped them apart amidst the rise of a multi-billion dollar industry. I'd recommend this for anyone who's spent way too many hours gaming or playing Dungeons and Dragons.
